export const egyptGovernorates: Record<string, string[]> = {
    "القاهرة": [
        "التجمع الخامس", "التجمع الأول", "التجمع الثالث", "مدينتي", "الرحاب", "مدينة نصر", "مصر الجديدة", "المعادي", "وسط البلد", "حلوان", "المرج", "عين شمس", "المطرية", "الزيتون", "شبرا مصر", "روض الفرج", "الشرابية", "الحدائق", "الوايلي", "منشأة ناصر", "المقطم", "البساتين", "دار السلام", "مصر القديمة", "السيدة زينب", "الخليفة", "منطقة اخرى"
    ],
    "الجيزة": [
        "المهندسين", "الدقي", "الهرم", "فيصل", "مدينة 6 أكتوبر", "الشيخ زايد", "العجوزة", "إمبابة", "الوراق", "بولاق الدكرور", "العمرانية", "المنيب", "البدرشين", "الحوامدية", "أطفيح", "العياط", "الصف", "أوسيم", "كرداسة", "منطقة اخرى"
    ],
    "اسكندرية": [
        "المنتزة", "الرمل", "سيدي بشر", "ميامي", "فيكتوريا", "العصافرة", "سيدي جابر", "سموحة", "الإبراهيمية", "الشاطبي", "محطة الرمل", "المنشية", "الجمرك", "العجمي", "الهانوفيل", "الدخيلة", "العامرية", "برج العرب", "منطقة اخرى"
    ],
    "الدقهلية": [
        "المنصورة", "طلخا", "ميت غمر", "السنبلاوين", "دكرنس", "بلقاس", "شربين", "منية النصر", "أجا", "تمي الأمديد", "بني عبيد", "نبروه", "الجمالية", "المطرية", "المنزلة", "منطقة اخرى"
    ],
    "الشرقية": [
        "الزقازيق", "العاشر من رمضان", "بلبيس", "مشتول السوق", "منيا القمح", "أبو حماد", "القرين", "فاقوس", "أبو كبير", "هيهيا", "ديرب نجم", "الإبراهيمية", "كفر صقر", "أولاد صقر", "الحسينية", "الصالحية الجديدة", "منطقة اخرى"
    ],
    "الغربية": [
        "طنطا", "المحلة الكبرى", "كفر الزيات", "زفتى", "السنطة", "قطور", "بسيون", "سمنود", "منطقة اخرى"
    ],
    "البحيرة": [
        "دمنهور", "كفر الدوار", "رشيد", "إدكو", "أبو حمص", "كفر الزيات", "إيتاي البارود", "شبراخيت", "الرحمانية", "كوم حمادة", "الدلنجات", "حوش عيسى", "أبو المطامير", "وادي النطرون", "النوبارية الجديدة", "منطقة اخرى"
    ],
    "المنوفية": [
        "شبين الكوم", "قويسنا", "بركة السبع", "تلا", "الشهداء", "أشمون", "الباجور", "منوف", "مدينة السادات", "منطقة اخرى"
    ],
    "كفر الشيخ": [
        "كفر الشيخ", "دسوق", "فوه", "مطوبس", "قلين", "سيدي سالم", "الرياض", "بيلا", "الحامول", "بلطيم", "منطقة اخرى"
    ],
    "القليوبية": [
        "بنها", "قليوب", "شبرا الخيمة", "الخصوص", "العبور", "الخانكة", "كفر شكر", "طوخ", "قناطر الخيرية", "منطقة اخرى"
    ],
    "الفيوم": [
        "الفيوم", "إطسا", "طامية", "سنورس", "إبشواي", "يوسف الصديق", "منطقة اخرى"
    ],
    "بني سويف": [
        "بني سويف", "الواسطى", "ناصر", "ببا", "سمسطا", "الفشن", "إهناسيا", "منطقة اخرى"
    ],
    "المنيا": [
        "المنيا", "المنيا الجديدة", "مغاغة", "بني مزار", "مطاي", "سمالوط", "أبو قرقاص", "ملوي", "دير مواس", "العدوة", "منطقة اخرى"
    ],
    "اسيوط": [
        "اسيوط", "ديروط", "القوصية", "منفلوط", "أبو تيج", "صدفا", "الغنايم", "ساحل سليم", "البداري", "أبنوب", "الفتح", "منطقة اخرى"
    ],
    "سوهاج": [
        "سوهاج", "أخميم", "البلينا", "جرجا", "دار السلام", "جهينة", "ساقلتة", "طما", "طهطا", "المراغة", "المنشأة", "منطقة اخرى"
    ],
    "قنا": [
        "قنا", "قوص", "نقادة", "قفط", "دشنا", "نجع حمادي", "فرشوط", "أبو تشت", "الوقف", "منطقة اخرى"
    ],
    "الاقصر": [
        "الاقصر", "القرنة", "أرمنت", "إسنا", "طيبة", "منطقة اخرى"
    ],
    "اسوان": [
        "اسوان", "دراو", "كوم أمبو", "إدفو", "نصر النوبة", "منطقة اخرى"
    ],
    "السويس": [
        "السويس", "الأربعين", "الجناين", "عتاقة", "فيصل", "منطقة اخرى"
    ],
    "الاسماعيلية": [
        "الاسماعيلية", "التل الكبير", "فايد", "القنطرة شرق", "القنطرة غرب", "أبو صوير", "القصاصين", "المستقبل", "منطقة اخرى"
    ],
    "بورسعيد": [
        "بورسعيد", "بورفؤاد", "منطقة اخرى"
    ],
    "البحر الاحمر": [
        "الغردقة", "رأس غارب", "سفاجا", "القصير", "مرسى علم", "شلاتين", "حلايب", "منطقة اخرى"
    ],
    "الغردقة": [
        "الغردقة", "الجونة", "سهل حشيش", "منطقة اخرى"
    ],
    "الجونة": [
        "الجونة", "منطقة اخرى"
    ],
    "الساحل الشمالي": [
        "الساحل الشمالي", "سيدي عبد الرحمن", "مارينا", "منطقة اخرى"
    ],
    "شرم الشيخ": [
        "شرم الشيخ", "خليج نعمة", "خليج نبق", "منطقة اخرى"
    ],
    "دهب": [
        "دهب", "منطقة اخرى"
    ],
    "مرسي علم": [
        "مرسي علم", "منطقة اخرى"
    ],
    "سفاجا": [
        "سفاجا", "منطقة اخرى"
    ],
    "راس غارب": [
        "رأس غارب", "منطقة اخرى"
    ],
    "الوادي الجديد": [
        "الخارجة", "الداخلة", "الفرافرة", "باريس", "بلاط", "منطقة اخرى"
    ],
    "حلايب وشلاتين": [
        "حلايب", "شلاتين", "منطقة اخرى"
    ]
};
